OpenFOAMcases/2DZP/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50 0 0.0);

boundaryField
{
	inlet
	{
	  type fixedValue;
	  value uniform (50 0 0.0);
	}

	top
	{
	  type freestreamVelocity;
	  freestreamValue	uniform (50 0 0);
	  value uniform (50 0 0.0);
	}

//    top
//    {
//      type        zeroGradient;
//    }

	outlet
	{
			type zeroGradient;
	}

    center
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            fixedValue;
		value           uniform (0 0 0);
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
