OpenFOAMcases/2DZP/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5;

boundaryField
{

    "(inlet|top)"
    {
      type            zeroGradient;
    }

	outlet
	{
			type      fixedValue;
			value     uniform 5.0;
	}

    center
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
